while True:
    mos = {".-": "A", "-...": "B", "-.-.": "C", "-..": "D", ".": "E", "..-.": "F", "--.": "G", "....": "H", "..": "I",
           ".---": "J", "-.-": "K", ".-..": "L", "--": "M", "-.": "N", "---": "O", ".--.": "P", "--.-": "Q", ".-.": "R",
           "...": "S", "-": "T", "..-": "U", "...-": "V", ".--": "W", "-..-": "X", "-.--": "Y", "--..": "Z", "":" ",
           "  ":" "}

    mos_inp = input("모스 부호를 입력하시오: ")
    mos_list = mos_inp.split(" ") # 이게 키포인트!! split() 이 아닌, split(" ")!!!!!
    for i in mos_total:
        print(mos.get(i), end="")
    print("") # 중요!